Revit 2027 API
BuiltInFailures.CuttingFailures.ElementsWithNotCopiedParentsDeleted Property
 Some elements were deleted because elements that they require for references were not copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsWithNotCopiedParentsDeleted { get; }
Public Shared ReadOnly Property ElementsWithNotCopiedParentsDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsWithNotCopiedParentsDeleted {
	FailureDefinitionId^ get ();
}
static member ElementsWithNotCopiedParentsDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CuttingFailures Class
Autodesk.Revit.DB Namespace